spec/fixtures/vcr_cassettes/new_subscription_page_founding_student.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/plans/lcl-founding-student
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.34.0
      Authorization:
      - Bearer sk_test_DHUDz8wyzjryyRLFCFyFZ7Yw
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.34.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Eva.local 15.3.0 Darwin Kernel Version 15.3.0: Thu Dec 10 18:40:58 PST 2015;
        root:xnu-3248.30.4~1/RELEASE_X86_64 x86_64","hostname":"Eva.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 Mar 2016 16:02:40 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '314'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_88VSu5GcK3KdxP
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "lcl-founding-student",
          "object": "plan",
          "amount": 9900,
          "created": 1454198932,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "name": "Lansing Code Lab (Founding Student)",
          "statement_descriptor": null,
          "trial_period_days": null
        }
    http_version: 
  recorded_at: Wed, 23 Mar 2016 16:02:39 GMT
recorded_with: VCR 2.9.3
